; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	thermograph1 - mode
	thermograph0 - mode
	image5 - mode
	spectrograph2 - mode
	image4 - mode
	infrared3 - mode
	GroundStation2 - direction
	GroundStation4 - direction
	Star3 - direction
	Star1 - direction
	Star0 - direction
	Star5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image4)
	(calibration_target instrument0 Star1)
	(supports instrument1 image5)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
	(supports instrument2 infrared3)
	(supports instrument2 image5)
	(calibration_target instrument2 Star3)
	(supports instrument3 spectrograph2)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star1)
	(supports instrument4 thermograph1)
	(supports instrument4 image5)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star12)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star1)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
	(supports instrument6 thermograph0)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 Star0)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star1)
)
(:goal (and
	(pointing satellite2 Phenomenon6)
	(pointing satellite3 Phenomenon9)
	(have_image Star5 infrared3)
	(have_image Star5 thermograph0)
	(have_image Phenomenon6 image5)
	(have_image Phenomenon6 thermograph1)
	(have_image Phenomenon7 image4)
	(have_image Planet8 image4)
	(have_image Planet8 spectrograph2)
	(have_image Phenomenon9 image4)
	(have_image Phenomenon9 thermograph0)
	(have_image Planet10 image5)
	(have_image Planet10 thermograph0)
	(have_image Phenomenon11 thermograph0)
	(have_image Phenomenon11 thermograph1)
	(have_image Star12 thermograph1)
	(have_image Star12 spectrograph2)
	(have_image Planet13 image4)
	(have_image Planet13 thermograph1)
))

)

; plan
1. (turn_to satellite1 star1 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star1)
   goals met: 0 of 19
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 19
3. (calibrate satellite1 instrument3 star1)
   added: (calibrated instrument3)
   goals met: 0 of 19
4. (turn_to satellite1 star5 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star5)
   goals met: 0 of 19
5. (take_image satellite1 star5 instrument3 thermograph0)
   added: (have_image star5 thermograph0)
   goals met: 1 of 19
6. (turn_to satellite1 star12 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star12)
   goals met: 1 of 19
7. (take_image satellite1 star12 instrument3 spectrograph2)
   added: (have_image star12 spectrograph2)
   goals met: 2 of 19
8. (turn_to satellite1 planet8 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 planet8)
   goals met: 2 of 19
9. (take_image satellite1 planet8 instrument3 spectrograph2)
   added: (have_image planet8 spectrograph2)
   goals met: 3 of 19
10. (turn_to satellite1 planet10 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet10)
   goals met: 3 of 19
11. (take_image satellite1 planet10 instrument3 thermograph0)
   added: (have_image planet10 thermograph0)
   goals met: 4 of 19
12. (turn_to satellite1 phenomenon9 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon9)
   goals met: 4 of 19
13. (take_image satellite1 phenomenon9 instrument3 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 5 of 19
14. (turn_to satellite1 phenomenon11 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon11)
   goals met: 5 of 19
15. (turn_to satellite0 star1 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star1)
   goals met: 5 of 19
16. (take_image satellite1 phenomenon11 instrument3 thermograph0)
   added: (have_image phenomenon11 thermograph0)
   goals met: 6 of 19
17. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 6 of 19
18. (switch_off instrument3 satellite1)
   deleted: (power_on instrument3)
   added: (power_avail satellite1)
   goals met: 6 of 19
19. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 6 of 19
20. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 6 of 19
21. (turn_to satellite0 phenomenon11 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon11)
   goals met: 6 of 19
22. (take_image satellite0 phenomenon11 instrument0 thermograph1)
   added: (have_image phenomenon11 thermograph1)
   goals met: 7 of 19
23. (turn_to satellite0 phenomenon6 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon6)
   goals met: 7 of 19
24. (take_image satellite0 phenomenon6 instrument0 thermograph1)
   added: (have_image phenomenon6 thermograph1)
   goals met: 8 of 19
25. (turn_to satellite0 phenomenon7 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon7)
   goals met: 8 of 19
26. (take_image satellite0 phenomenon7 instrument0 image4)
   added: (have_image phenomenon7 image4)
   goals met: 9 of 19
27. (turn_to satellite0 phenomenon9 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon9)
   goals met: 9 of 19
28. (take_image satellite0 phenomenon9 instrument0 image4)
   added: (have_image phenomenon9 image4)
   goals met: 10 of 19
29. (turn_to satellite0 planet13 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet13)
   goals met: 10 of 19
30. (take_image satellite0 planet13 instrument0 image4)
   added: (have_image planet13 image4)
   goals met: 11 of 19
31. (take_image satellite0 planet13 instrument0 thermograph1)
   added: (have_image planet13 thermograph1)
   goals met: 12 of 19
32. (turn_to satellite0 planet8 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet8)
   goals met: 12 of 19
33. (take_image satellite0 planet8 instrument0 image4)
   added: (have_image planet8 image4)
   goals met: 13 of 19
34. (turn_to satellite0 star12 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star12)
   goals met: 13 of 19
35. (take_image satellite0 star12 instrument0 thermograph1)
   added: (have_image star12 thermograph1)
   goals met: 14 of 19
36. (turn_to satellite1 star3 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 star3)
   goals met: 14 of 19
37. (calibrate satellite1 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 14 of 19
38. (turn_to satellite1 phenomenon6 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon6)
   goals met: 14 of 19
39. (take_image satellite1 phenomenon6 instrument2 image5)
   added: (have_image phenomenon6 image5)
   goals met: 15 of 19
40. (turn_to satellite1 planet10 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 planet10)
   goals met: 15 of 19
41. (take_image satellite1 planet10 instrument2 image5)
   added: (have_image planet10 image5)
   goals met: 16 of 19
42. (turn_to satellite1 star5 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star5)
   goals met: 16 of 19
43. (take_image satellite1 star5 instrument2 infrared3)
   added: (have_image star5 infrared3)
   goals met: 17 of 19
44. (turn_to satellite2 phenomenon6 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 phenomenon6)
   goals met: 18 of 19
45. (turn_to satellite3 phenomenon9 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 phenomenon9)
   goals met: 19 of 19
